## plan (prd)

Parameter: none

✓ Plan successfull
✓ Plan summary:

|  CHANGE  |                                                      RESOURCE                                                       |
|----------|---------------------------------------------------------------------------------------------------------------------|
| add      | `module.resource_group_net["eastus"].azurerm_resource_group.this`                                                   |
|          | `module.resource_group_net["germanywestcentral"].azurerm_resource_group.this`                                       |
| recreate | `module.resource_group["eastus"].azurerm_resource_group.this`                                                       |
|          | `module.resource_group["germanywestcentral"].azurerm_resource_group.this`                                           |
|          | `module.vnet["eastus"].module.subnet["sub1"].azurerm_network_security_group.this[0]`                                |
|          | `module.vnet["eastus"].module.subnet["sub1"].azurerm_subnet.this`                                                   |
|          | `module.vnet["eastus"].module.subnet["sub1"].azurerm_subnet_network_security_group_association.this[0]`             |
|          | `module.vnet["eastus"].module.vnet[0].azurerm_virtual_network.this`                                                 |
|          | `module.vnet["germanywestcentral"].module.subnet["sub1"].azurerm_network_security_group.this[0]`                    |
|          | `module.vnet["germanywestcentral"].module.subnet["sub1"].azurerm_subnet.this`                                       |
|          | `module.vnet["germanywestcentral"].module.subnet["sub1"].azurerm_subnet_network_security_group_association.this[0]` |
|          | `module.vnet["germanywestcentral"].module.vnet[0].azurerm_virtual_network.this`                                     |
✓ Plan Details:

<details>

<summary>Details of tofu plan</summary>

```console


OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

OpenTofu will perform the following actions:

  # module.resource_group["eastus"].azurerm_resource_group.this must be replaced
-/+ resource "azurerm_resource_group" "this" {
      ~ id         = "/subscriptions/da733702-a697-4e22-bb0b-8c3e60bb51db/resourceGroups/on-eus1-prd-vdi-rg" -> (known after apply)
      ~ name       = "on-eus1-prd-vdi-rg" -> "on-eus1-prd-vdi-vm-rg" # forces replacement
        tags       = {
            "OPS:Environment"     = "PRD"
            "OPS:Source"          = "otc-code/res-azr-rg-v1.0.0"
            "OPS:State"           = "NONPROD"
            "ORG:ApplicationName" = "vdi"
            "SEC:DCL"             = "basic"
        }
        # (2 unchanged attributes hidden)
    }

  # module.resource_group["germanywestcentral"].azurerm_resource_group.this must be replaced
-/+ resource "azurerm_resource_group" "this" {
      ~ id         = "/subscriptions/da733702-a697-4e22-bb0b-8c3e60bb51db/resourceGroups/on-gwce-prd-vdi-rg" -> (known after apply)
      ~ name       = "on-gwce-prd-vdi-rg" -> "on-gwce-prd-vdi-vm-rg" # forces replacement
        tags       = {
            "OPS:Environment"     = "PRD"
            "OPS:Source"          = "otc-code/res-azr-rg-v1.0.0"
            "OPS:State"           = "NONPROD"
            "ORG:ApplicationName" = "vdi"
            "SEC:DCL"             = "basic"
        }
        # (2 unchanged attributes hidden)
    }

  # module.resource_group_net["eastus"].azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id         = (known after apply)
      + location   = "eastus"
      + managed_by = "1018b490-2e4d-48b5-b103-ca74855887d4"
      + name       = "on-eus1-prd-vdi-net-rg"
      + tags       = {
          + "OPS:Environment"     = "PRD"
          + "OPS:Source"          = "otc-code/res-azr-rg-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
    }

  # module.resource_group_net["germanywestcentral"].azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id         = (known after apply)
      + location   = "germanywestcentral"
      + managed_by = "1018b490-2e4d-48b5-b103-ca74855887d4"
      + name       = "on-gwce-prd-vdi-net-rg"
      + tags       = {
          + "OPS:Environment"     = "PRD"
          + "OPS:Source"          = "otc-code/res-azr-rg-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
    }

  # module.vnet["eastus"].data.azurerm_virtual_network.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_virtual_network" "this" {
      + address_space           = (known after apply)
      + dns_servers             = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = (known after apply)
      + name                    = "on-eus1-prd-vdi-vnet"
      + resource_group_name     = "on-eus1-prd-vdi-net-rg"
      + subnets                 = (known after apply)
      + tags                    = (known after apply)
      + vnet_peerings           = (known after apply)
      + vnet_peerings_addresses = (known after apply)
    }

  # module.vnet["germanywestcentral"].data.azurerm_virtual_network.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_virtual_network" "this" {
      + address_space           = (known after apply)
      + dns_servers             = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = (known after apply)
      + name                    = "on-gwce-prd-vdi-vnet"
      + resource_group_name     = "on-gwce-prd-vdi-net-rg"
      + subnets                 = (known after apply)
      + tags                    = (known after apply)
      + vnet_peerings           = (known after apply)
      + vnet_peerings_addresses = (known after apply)
    }

  # module.vnet["eastus"].module.subnet["sub1"].azurerm_network_security_group.this[0] must be replaced
-/+ resource "azurerm_network_security_group" "this" {
      ~ id                  = "/subscriptions/da733702-a697-4e22-bb0b-8c3e60bb51db/resourceGroups/on-eus1-prd-vdi-rg/providers/Microsoft.Network/networkSecurityGroups/on-eus1-prd-vdi-vnet-sub-1-vm-sg" -> (known after apply)
        name                = "on-eus1-prd-vdi-vnet-sub-1-vm-sg"
      ~ resource_group_name = "on-eus1-prd-vdi-rg" -> "on-eus1-prd-vdi-net-rg" # forces replacement
      ~ security_rule       = [] -> (known after apply)
      - tags                = {} -> null
        # (1 unchanged attribute hidden)
    }

  # module.vnet["eastus"].module.subnet["sub1"].azurerm_subnet.this must be replaced
-/+ resource "azurerm_subnet" "this" {
      ~ id                                            = "/subscriptions/da733702-a697-4e22-bb0b-8c3e60bb51db/resourceGroups/on-eus1-prd-vdi-rg/providers/Microsoft.Network/virtualNetworks/on-eus1-prd-vdi-vnet/subnets/on-eus1-prd-vdi-vnet-sub-1-vm" -> (known after apply)
        name                                          = "on-eus1-prd-vdi-vnet-sub-1-vm"
      ~ resource_group_name                           = "on-eus1-prd-vdi-rg" -> "on-eus1-prd-vdi-net-rg" # forces replacement
      - service_endpoint_policy_ids                   = [] -> null
      - service_endpoints                             = [] -> null
        # (5 unchanged attributes hidden)
    }

  # module.vnet["eastus"].module.subnet["sub1"].azurerm_subnet_network_security_group_association.this[0] must be replaced
-/+ resource "azurerm_subnet_network_security_group_association" "this" {
      ~ id                        = "/subscriptions/da733702-a697-4e22-bb0b-8c3e60bb51db/resourceGroups/on-eus1-prd-vdi-rg/providers/Microsoft.Network/virtualNetworks/on-eus1-prd-vdi-vnet/subnets/on-eus1-prd-vdi-vnet-sub-1-vm" -> (known after apply)
      ~ network_security_group_id = "/subscriptions/da733702-a697-4e22-bb0b-8c3e60bb51db/resourceGroups/on-eus1-prd-vdi-rg/providers/Microsoft.Network/networkSecurityGroups/on-eus1-prd-vdi-vnet-sub-1-vm-sg" # forces replacement -> (known after apply) # forces replacement
      ~ subnet_id                 = "/subscriptions/da733702-a697-4e22-bb0b-8c3e60bb51db/resourceGroups/on-eus1-prd-vdi-rg/providers/Microsoft.Network/virtualNetworks/on-eus1-prd-vdi-vnet/subnets/on-eus1-prd-vdi-vnet-sub-1-vm" # forces replacement -> (known after apply) # forces replacement
    }

  # module.vnet["eastus"].module.vnet[0].azurerm_virtual_network.this must be replaced
-/+ resource "azurerm_virtual_network" "this" {
      ~ guid                    = "5ac41f39-3bc4-4ca3-aea7-81f147322bc6" -> (known after apply)
      ~ id                      = "/subscriptions/da733702-a697-4e22-bb0b-8c3e60bb51db/resourceGroups/on-eus1-prd-vdi-rg/providers/Microsoft.Network/virtualNetworks/on-eus1-prd-vdi-vnet" -> (known after apply)
        name                    = "on-eus1-prd-vdi-vnet"
      ~ resource_group_name     = "on-eus1-prd-vdi-rg" -> "on-eus1-prd-vdi-net-rg" # forces replacement
      ~ subnet                  = [
          - {
              - address_prefixes                              = [
                  - "10.1.1.0/24",
                ]
              - default_outbound_access_enabled               = true
              - delegation                                    = []
              - id                                            = "/subscriptions/da733702-a697-4e22-bb0b-8c3e60bb51db/resourceGroups/on-eus1-prd-vdi-rg/providers/Microsoft.Network/virtualNetworks/on-eus1-prd-vdi-vnet/subnets/on-eus1-prd-vdi-vnet-sub-1-vm"
              - name                                          = "on-eus1-prd-vdi-vnet-sub-1-vm"
              - private_endpoint_network_policies             = "Enabled"
              - private_link_service_network_policies_enabled = true
              - route_table_id                                = ""
              - security_group                                = "/subscriptions/da733702-a697-4e22-bb0b-8c3e60bb51db/resourceGroups/on-eus1-prd-vdi-rg/providers/Microsoft.Network/networkSecurityGroups/on-eus1-prd-vdi-vnet-sub-1-vm-sg"
              - service_endpoint_policy_ids                   = []
              - service_endpoints                             = []
            },
        ] -> (known after apply)
        tags                    = {
            "OPS:Environment"     = "PRD"
            "OPS:Source"          = "otc-code/res-azr-vnet-main"
            "OPS:State"           = "NONPROD"
            "ORG:ApplicationName" = "vdi"
            "SEC:DCL"             = "basic"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vnet["germanywestcentral"].module.subnet["sub1"].azurerm_network_security_group.this[0] must be replaced
-/+ resource "azurerm_network_security_group" "this" {
      ~ id                  = "/subscriptions/da733702-a697-4e22-bb0b-8c3e60bb51db/resourceGroups/on-gwce-prd-vdi-rg/providers/Microsoft.Network/networkSecurityGroups/on-gwce-prd-vdi-vnet-sub-1-vm-sg" -> (known after apply)
        name                = "on-gwce-prd-vdi-vnet-sub-1-vm-sg"
      ~ resource_group_name = "on-gwce-prd-vdi-rg" -> "on-gwce-prd-vdi-net-rg" # forces replacement
      ~ security_rule       = [
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "3389"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "AllowAnyRDPInbound"
              - priority                                   = 100
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = "*"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "4902"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "KASM"
              - priority                                   = 110
              - protocol                                   = "*"
              - source_address_prefix                      = "*"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
        ] -> (known after apply)
      - tags                = {} -> null
        # (1 unchanged attribute hidden)
    }

  # module.vnet["germanywestcentral"].module.subnet["sub1"].azurerm_subnet.this must be replaced
-/+ resource "azurerm_subnet" "this" {
      ~ id                                            = "/subscriptions/da733702-a697-4e22-bb0b-8c3e60bb51db/resourceGroups/on-gwce-prd-vdi-rg/providers/Microsoft.Network/virtualNetworks/on-gwce-prd-vdi-vnet/subnets/on-gwce-prd-vdi-vnet-sub-1-vm" -> (known after apply)
        name                                          = "on-gwce-prd-vdi-vnet-sub-1-vm"
      ~ resource_group_name                           = "on-gwce-prd-vdi-rg" -> "on-gwce-prd-vdi-net-rg" # forces replacement
      - service_endpoint_policy_ids                   = [] -> null
      - service_endpoints                             = [] -> null
        # (5 unchanged attributes hidden)
    }

  # module.vnet["germanywestcentral"].module.subnet["sub1"].azurerm_subnet_network_security_group_association.this[0] must be replaced
-/+ resource "azurerm_subnet_network_security_group_association" "this" {
      ~ id                        = "/subscriptions/da733702-a697-4e22-bb0b-8c3e60bb51db/resourceGroups/on-gwce-prd-vdi-rg/providers/Microsoft.Network/virtualNetworks/on-gwce-prd-vdi-vnet/subnets/on-gwce-prd-vdi-vnet-sub-1-vm" -> (known after apply)
      ~ network_security_group_id = "/subscriptions/da733702-a697-4e22-bb0b-8c3e60bb51db/resourceGroups/on-gwce-prd-vdi-rg/providers/Microsoft.Network/networkSecurityGroups/on-gwce-prd-vdi-vnet-sub-1-vm-sg" # forces replacement -> (known after apply) # forces replacement
      ~ subnet_id                 = "/subscriptions/da733702-a697-4e22-bb0b-8c3e60bb51db/resourceGroups/on-gwce-prd-vdi-rg/providers/Microsoft.Network/virtualNetworks/on-gwce-prd-vdi-vnet/subnets/on-gwce-prd-vdi-vnet-sub-1-vm" # forces replacement -> (known after apply) # forces replacement
    }

  # module.vnet["germanywestcentral"].module.vnet[0].azurerm_virtual_network.this must be replaced
-/+ resource "azurerm_virtual_network" "this" {
      ~ guid                    = "170253ce-34fa-4e88-8ee8-4aac63621664" -> (known after apply)
      ~ id                      = "/subscriptions/da733702-a697-4e22-bb0b-8c3e60bb51db/resourceGroups/on-gwce-prd-vdi-rg/providers/Microsoft.Network/virtualNetworks/on-gwce-prd-vdi-vnet" -> (known after apply)
        name                    = "on-gwce-prd-vdi-vnet"
      ~ resource_group_name     = "on-gwce-prd-vdi-rg" -> "on-gwce-prd-vdi-net-rg" # forces replacement
      ~ subnet                  = [
          - {
              - address_prefixes                              = [
                  - "10.1.1.0/24",
                ]
              - default_outbound_access_enabled               = true
              - delegation                                    = []
              - id                                            = "/subscriptions/da733702-a697-4e22-bb0b-8c3e60bb51db/resourceGroups/on-gwce-prd-vdi-rg/providers/Microsoft.Network/virtualNetworks/on-gwce-prd-vdi-vnet/subnets/on-gwce-prd-vdi-vnet-sub-1-vm"
              - name                                          = "on-gwce-prd-vdi-vnet-sub-1-vm"
              - private_endpoint_network_policies             = "Enabled"
              - private_link_service_network_policies_enabled = true
              - route_table_id                                = ""
              - security_group                                = "/subscriptions/da733702-a697-4e22-bb0b-8c3e60bb51db/resourceGroups/on-gwce-prd-vdi-rg/providers/Microsoft.Network/networkSecurityGroups/on-gwce-prd-vdi-vnet-sub-1-vm-sg"
              - service_endpoint_policy_ids                   = []
              - service_endpoints                             = []
            },
        ] -> (known after apply)
        tags                    = {
            "OPS:Environment"     = "PRD"
            "OPS:Source"          = "otc-code/res-azr-vnet-main"
            "OPS:State"           = "NONPROD"
            "ORG:ApplicationName" = "vdi"
            "SEC:DCL"             = "basic"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 12 to add, 0 to change, 10 to destroy.
```
</details>


▲ This plan will delete 10 resources!

✓ tofu plan: 12 to add, 0 to change, 10 to destroy.
